[
    {
        "projectName": "Coders Lab Workshop_Bestshop",
        "description": "For this project, I developed an interactive calculator for the BestShop project that dynamically updates pricing based on user inputs. The calculator handles various events like changes, clicks, and focus/blur actions to provide a seamless user experience.",
        "context": "This project was part of a workshop focused on reinforcing JavaScript skills through practical application. It involved creating a user-friendly tool to enhance the BestShop website's functionality.",
        "technologiesUsed": [
            {
                "name": "JavaScript (ES6)",
                "purpose": "For DOM manipulation and real-time updates"
            }, {
                "name": "SASS",
                "purpose": "Used for responsive and maintainable styling."
            }, {
                "name": "Parcel",
                "purpose": "Module bundler for efficient code management."
            }, {
                "name": "HTML/CSS",
                "purpose": "Structured the interactive elements and overall layout."
            }
        ]
    }, {
        "projectName": "Zaplanuj Jedzonko – Coders Lab Scrumlab_project",
        "description": "The ScrumLab project was designed to simulate real-world teamwork in a web application development environment. The goal was to replicate the dynamics of a development team, focusing on code reviews, problem-solving, and integrating code with fellow team members.This project helped strengthen my skills in collaborative coding, version control, and agile practices, essential for working in a real-world development team. This project highlights my ability to create engaging front-end solutions with a focus on dynamic interactions and responsive design.",
        "context": "This project was completed as part of a week-long sprint, working in a team of three. The focus was on self-directed learning, with minimal instructor intervention, to develop collaborative skills and experience a workflow similar to real-world software projects.",
        "technologiesUsed": [
            {
                "name": "Version Control (Git & GitHub)",
                "purpose": "Used for branching, committing, pull requests, and code merging."
            }, {
                "name": "JavaScript & Webpack",
                "purpose": "Structured code modularly for efficient web application development."
            }, {
                "name": "SASS & Parcel",
                "purpose": "For responsive styling and seamless development workflow."
            }, {
                "name": "Agile Methodologies (Scrum, Kanban)",
                "purpose": "Simulated daily stand-ups, sprint planning, and retrospectives."
            }
        ]
    }
]